SELECT
    T.`Время_занятия`,
    GROUP_CONCAT(IF(S.`День_недели` = '1. ПН', P.`Наименование`, NULL)) AS 'ПН',
    GROUP_CONCAT(IF(S.`День_недели` = '2. ВТ', P.`Наименование`, NULL)) AS 'ВТ',
    GROUP_CONCAT(IF(S.`День_недели` = '3. СР', P.`Наименование`, NULL)) AS 'СР',
    GROUP_CONCAT(IF(S.`День_недели` = '4. ЧТ', P.`Наименование`, NULL)) AS 'ЧТ',
    GROUP_CONCAT(IF(S.`День_недели` = '5. ПТ', P.`Наименование`, NULL)) AS 'ПТ',
    GROUP_CONCAT(IF(S.`День_недели` = '6. СБ', P.`Наименование`, NULL)) AS 'СБ'

FROM `Занятия` AS S
    INNER JOIN Предметы     AS P ON S.`Предмет_ID` = P.`Предмет_ID`
    INNER JOIN Время        AS T ON S.`Время_ID` = T.`Время_ID`
    INNER JOIN Пользователи AS U ON S.`Класс_ID` = U.`Класс_ID`
    INNER JOIN Подгруппы    AS G ON S.`Подгруппа_ID` = G.`Подгруппа_ID`

WHERE ((U.`ФИО` = 'Кучеренко М.А.') AND 
    ((S.`Подгруппа_ID`) = U.`Подгруппа_ID` OR (S.`Подгруппа_ID`) = 8 OR (S.`Подгруппа_ID`) IS NULL))

GROUP BY T.`Время_занятия`


----------------------------------------------------------------------------------------------------------------
ALTER TABLE `Занятия` ADD CONSTRAINT `занятия_ibfk_2` FOREIGN KEY (`Время_ID`) REFERENCES `Время`(`Время_ID`) ON DELETE CASCADE ON UPDATE NO ACTION;
----------------------------------------------------------------------------------------------------------------

SELECT
    T.`Время_занятия`,
    GROUP_CONCAT(
        IF(S.`День_недели` = '1. ПН', 
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
        ) AS 'ПН',
    GROUP_CONCAT(
        IF(S.`День_недели` = '2. ВТ',
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
        ) AS 'ВТ',
    GROUP_CONCAT(
        IF(S.`День_недели` = '3. СР',
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
        ) AS 'СР',
    GROUP_CONCAT(
        IF(S.`День_недели` = '4. ЧТ',
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
        ) AS 'ЧТ',
    GROUP_CONCAT(
        IF(S.`День_недели` = '5. ПТ',
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
        ) AS 'ПТ',
    GROUP_CONCAT(
        IF(S.`День_недели` = '6. СБ',
            CONCAT(P.`Наименование`, ' ', C.`Год_обучения`, C.`Буква_класса`, ' ', R.`Номер`),
            NULL)
    ) AS 'СБ'

FROM `Занятия` AS S
    INNER JOIN Классы       AS C ON S.`Класс_ID` = C.`Класс_ID`
    INNER JOIN Кабинеты     AS R ON S.`Кабинет_ID` = R.`Кабинет_ID`
    INNER JOIN Предметы     AS P ON S.`Предмет_ID` = P.`Предмет_ID`
    INNER JOIN Время        AS T ON S.`Время_ID` = T.`Время_ID`
    INNER JOIN Пользователи AS U ON S.`Учитель_ID` = U.`Пользователь_ID`

WHERE (U.`ФИО` = 'Еремеева Марина Викторовна')

GROUP BY T.`Время_занятия`

----------------------------------------------------------------------------------------------------------------

SELECT
    t.`Время_занятия`,
    GROUP_CONCAT(IF(z.`День_недели` = '1. ПН', p.`Наименование`, NULL)) AS 'ПН',
    GROUP_CONCAT(IF(z.`День_недели` = '2. ВТ', p.`Наименование`, NULL)) AS 'ВТ',
    GROUP_CONCAT(IF(z.`День_недели` = '3. СР', p.`Наименование`, NULL)) AS 'СР',
    GROUP_CONCAT(IF(z.`День_недели` = '4. ЧТ', p.`Наименование`, NULL)) AS 'ЧТ',
    GROUP_CONCAT(IF(z.`День_недели` = '5. ПТ', p.`Наименование`, NULL)) AS 'ПТ',
    GROUP_CONCAT(IF(z.`День_недели` = '6. СЮ', p.`Наименование`, NULL)) AS 'СБ'
FROM `Занятия` AS z
LEFT JOIN `Предметы` AS p ON p.`Предмет_ID` = z.`Предмет_ID`
LEFT JOIN `Время`    AS t ON t.`Время_ID` = z.`Время_ID`
WHERE z.`Класс_ID` = '1' AND (z.`Подгруппа_ID` = '1' OR z.`Подгруппа_ID` IS NULL)
GROUP BY t.`Время_занятия`